class Translation(object):
    START_TEXT = """🇭 🇮 {},
𝙄'𝙢 𝙐𝙍𝙇 𝙓 𝙐𝙥𝙡𝙤𝙖𝙙𝙚𝙧!
𝙔𝙤𝙪 𝙘𝙖𝙣 𝙪𝙥𝙡𝙤𝙖𝙙 𝙃𝙏𝙏𝙋/𝙃𝙏𝙏𝙋𝙎 𝙙𝙞𝙧𝙚𝙘𝙩 𝙡𝙞𝙣𝙠, 𝙐𝙨𝙞𝙣𝙜 𝙩𝙝𝙞𝙨 𝙗𝙤𝙩!

/help 𝙛𝙤𝙧 𝙢𝙤𝙧𝙚 𝙙𝙚𝙩𝙖𝙞𝙡𝙨!"""
    FORMAT_SELECTION = "Select the desired format: <a href='{}'>file size might be approximate</a> \n𝐈𝐟 𝐲𝐨𝐮 𝐰𝐚𝐧𝐭 𝐭𝐨 𝐬𝐞𝐭 𝐜𝐮𝐬𝐭𝐨𝐦 𝐭𝐡𝐮𝐦𝐛𝐧𝐚𝐢𝐥, 𝐬𝐞𝐧𝐝 𝐩𝐡𝐨𝐭𝐨 𝐛𝐞𝐟𝐨𝐫𝐞 𝐨𝐫 𝐪𝐮𝐢𝐜𝐤𝐥𝐲 𝐚𝐟𝐭𝐞𝐫 𝐭𝐚𝐩𝐩𝐢𝐧𝐠 𝐨𝐧 𝐚𝐧𝐲 𝐨𝐟 𝐭𝐡𝐞 𝐛𝐞𝐥𝐨𝐰 𝐛𝐮𝐭𝐭𝐨𝐧𝐬.\n𝐘𝐨𝐮 𝐜𝐚𝐧 𝐮𝐬𝐞 /deletethumbnail  𝐭𝐨 𝐝𝐞𝐥𝐞𝐭𝐞 𝐭𝐡𝐞 𝐚𝐮𝐭𝐨-𝐠𝐞𝐧𝐞𝐫𝐚𝐭𝐞𝐝 𝐭𝐡𝐮𝐦𝐛𝐧𝐚𝐢𝐥.."
    SET_CUSTOM_USERNAME_PASSWORD = """If you want to download premium videos, provide in the following format:
URL | filename | username | password"""
    DOWNLOAD_START = "ᴺᵒʷ🔥⃟☆ᵈᵒʷⁿˡᵒᵃᵈᶦⁿᵍ༉..."
    UPLOAD_START = "ᖰ⸼⊑ⁿᵒʷ ᵘᵖˡᵒᵃᵈᶦⁿᵍ⊒⸼ᖱ"
    RCHD_TG_API_LIMIT = "Downloaded in {} seconds.\nDetected File Size: {}\nSorry. But, I cannot upload files greater than 2GB due to Telegram API limitations."
    AFTER_SUCCESSFUL_UPLOAD_MSG = "Thanks for using @URL_Uploaderibot)"
    AFTER_SUCCESSFUL_UPLOAD_MSG_WITH_TS = "ᴅᴏᴡɴʟᴏᴀᴅᴇᴅ ɪɴ {} seconds.\nᴜᴘʟᴏᴀᴅᴇᴅ ɪɴ {} seconds.\n\n@URL_Uploaderibot"
    SAVED_CUSTOM_THUMB_NAIL = "𝑪𝒖𝒔𝒕𝒐𝒎 𝒗𝒊𝒅𝒆𝒐 / 𝒇𝒊𝒍𝒆 𝒕𝒉𝒖𝒎𝒃𝒏𝒂𝒊𝒍 𝒔𝒂𝒗𝒆𝒅. 𝑻𝒉𝒊𝒔 𝒊𝒎𝒂𝒈𝒆 𝒘𝒊𝒍𝒍 𝒃𝒆 𝒖𝒔𝒆𝒅 𝒊𝒏 𝒕𝒉𝒆 𝒗𝒊𝒅𝒆𝒐 / 𝒇𝒊𝒍𝒆."
    DEL_ETED_CUSTOM_THUMB_NAIL = "✅ ᶜᵘˢᵗᵒᵐ ᵗʰᵘᵐᵇⁿᵃⁱˡ ᶜˡᵉᵃʳᵉᵈ ˢᵘᶜᶜᵉˢᶠᵘˡˡʸ.."
    CUSTOM_CAPTION_UL_FILE = "{}"
    NO_VOID_FORMAT_FOUND = "ERROR...\n<b>YouTubeDL</b> said: {}"
    HELP_USER = """𝐇𝐨𝐰 𝐭𝐨 𝐔𝐬𝐞 𝐌𝐞? 𝐅𝐨𝐥𝐥𝐨𝐰 𝐓𝐡𝐞𝐬𝐞 𝐬𝐭𝐞𝐩𝐬!
    
𝟏. 𝐒𝐞𝐧𝐝 𝐮𝐫𝐥 (𝐞𝐱𝐚𝐦𝐩𝐥𝐞.𝐝𝐨𝐦𝐚𝐢𝐧/𝐅𝐢𝐥𝐞.𝐦𝐩𝟒 | 𝐍𝐞𝐰 𝐅𝐢𝐥𝐞𝐧𝐚𝐦𝐞.𝐦𝐩𝟒).
𝟐. 𝐒𝐞𝐧𝐝 𝐈𝐦𝐚𝐠𝐞 𝐀𝐬 𝐂𝐮𝐬𝐭𝐨𝐦 𝐓𝐡𝐮𝐦𝐛𝐧𝐚𝐢𝐥 (𝐎𝐩𝐭𝐢𝐨𝐧𝐚𝐥).
𝟑. 𝐒𝐞𝐥𝐞𝐜𝐭 𝐭𝐡𝐞 𝐛𝐮𝐭𝐭𝐨𝐧.
   𝐒𝐕𝐢𝐝𝐞𝐨 - 𝐆𝐢𝐯𝐞 𝐅𝐢𝐥𝐞 𝐚𝐬 𝐯𝐢𝐝𝐞𝐨 𝐰𝐢𝐭𝐡 𝐒𝐜𝐫𝐞𝐞𝐧𝐬𝐡𝐨𝐭𝐬
   𝐃𝐅𝐢𝐥𝐞  - 𝐆𝐢𝐯𝐞 𝐅𝐢𝐥𝐞 (𝐯𝐢𝐝𝐞𝐨) 𝐚𝐬 𝐟𝐢𝐥𝐞 𝐰𝐢𝐭𝐡 𝐒𝐜𝐫𝐞𝐞𝐧𝐬𝐡𝐨𝐭𝐬
   𝐕𝐢𝐝𝐞𝐨  - 𝐆𝐢𝐯𝐞 𝐅𝐢𝐥𝐞 𝐚𝐬 𝐯𝐢𝐝𝐞𝐨 𝐰𝐢𝐭𝐡𝐨𝐮𝐭 𝐒𝐜𝐫𝐞𝐞𝐧𝐬𝐡𝐨𝐭𝐬
   𝐅𝐢𝐥𝐞   - 𝐆𝐢𝐯𝐞 𝐅𝐢𝐥𝐞 𝐰𝐢𝐭𝐡𝐨𝐮𝐭 𝐒𝐜𝐫𝐞𝐞𝐧𝐬𝐡𝐨𝐭𝐬

𝐈𝐟 𝐛𝐨𝐭 𝐝𝐢𝐝𝐧'𝐭 𝐫𝐞𝐬𝐩𝐨𝐧𝐝, 𝐜𝐨𝐧𝐭𝐚𝐜𝐭 @Savior_128

𝐇𝐞𝐫𝐞'𝐬 𝐢𝐬 𝐭𝐡𝐞 𝐥𝐢𝐬𝐭 𝐨𝐟 𝐚𝐥𝐥 𝐭𝐡𝐞 𝐬𝐮𝐩𝐩𝐨𝐫𝐭𝐞𝐝 𝐬𝐢𝐭𝐞𝐬, 𝐨𝐫𝐝𝐞𝐫𝐞𝐝 𝐚𝐥𝐩𝐡𝐚𝐛𝐞𝐭𝐢𝐜𝐚𝐥𝐥𝐲:

https://ytdl-org.github.io/youtube-dl/supportedsites.html"""
    REPLY_TO_MEDIA_ALBUM_TO_GEN_THUMB = "Reply /genthumbnail to a media album, to generate custom thumbnail"
    ERR_ONLY_TWO_MEDIA_IN_ALBUM = "Media Album should contain only two photos. Please re-send the media album, and then try again, or send only two photos in an album."
    CANCEL_STR = "Process Cancelled"
    ZIP_UPLOADED_STR = "Uploaded {} files in {} seconds"
    SLOW_URL_DECED = "Gosh that seems to be a very slow URL. Since you were screwing my home, I am in no mood to download this file. Meanwhile, why don't you try this:==> https://shrtz.me/PtsVnf6 and get me a fast URL so that I can upload to Telegram, without me slowing down for other users."
